# Bonus: Temperature Analysis I

In [53]:
import pandas as pd
from datetime import datetime as dt

In [63]:
# "tobs" is "temperature observations"
df = pd.read_csv('./Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [64]:
# Convert the date column format from string to datetime
df['date'] = df['date'].astype('datetime64[ns]')
df['date']

0       2010-01-01
1       2010-01-02
2       2010-01-03
3       2010-01-04
4       2010-01-06
           ...
19545   2017-08-19
19546   2017-08-20
19547   2017-08-21
19548   2017-08-22
19549   2017-08-23
Name: date, Length: 19550, dtype: datetime64[ns]

In [65]:
# Set the date column as the DataFrame index

df = df.set_index("date")
df

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73
...                 ...   ...   ...
2017-08-19  USC00516128  0.09    71
2017-08-20  USC00516128   NaN    78
2017-08-21  USC00516128  0.56    76
2017-08-22  USC00516128  0.50    76
2017-08-23  USC00516128  0.45    76

[19550 rows x 3 columns]

In [66]:
# Drop the date column
df.reset_index(drop=True, inplace=True)
df

           station  prcp  tobs
0      USC00519397  0.08    65
1      USC00519397  0.00    63
2      USC00519397  0.00    74
3      USC00519397  0.00    76
4      USC00519397   NaN    73
...            ...   ...   ...
19545  USC00516128  0.09    71
19546  USC00516128   NaN    78
19547  USC00516128  0.56    76
19548  USC00516128  0.50    76
19549  USC00516128  0.45    76

[19550 rows x 3 columns]

### Compare June and December data across all years

In [67]:
from scipy import stats

import numpy as np
import pandas as pd
import datetime as dt

# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func, inspect, extract

In [68]:
# create engine to hawaii.sqlite
engine = create_engine("sqlite:///Resources/hawaii.sqlite")

# reflect an existing database into a new model
Base = automap_base()

# reflect the tables
Base.prepare(engine, reflect=True)

# View all of the classes that automap found
Base.classes.keys()

# Save references to each table
Measurement = Base.classes.measurement
Station = Base.classes.station

# Create our session (link) from Python to the DB
session = Session(engine)

In [69]:
# Filter data for desired months

In [70]:
# Identify the average temperature for June
june_temps = session.query(Measurement.date, Measurement.tobs)\
    .filter(extract("month", Measurement.date) == "6").all()

# Convert to data frame
june_temps = pd.DataFrame(june_temps, columns = ["Date", "Temperature"])

In [71]:
# Identify the average temperature for December
dec_temps = session.query(Measurement.date, Measurement.tobs)\
    .filter(extract("month", Measurement.date) == "12").all()

# Convert to data frame
dec_temps = pd.DataFrame(dec_temps, columns = ["Date", "Temperature"])

In [72]:
# Create collections of temperature data

june = june_temps["Temperature"]
dec = dec_temps["Temperature"]

In [73]:
# Run paired t-test
from scipy.stats import ttest_ind

t, p = ttest_ind(june, dec)
print(f"The paired t-test values: t = {t:.3f}, and the p-value is {p:.3f}")

The paired t-test values: t = 31.604, and the p-value is 0.000

### Analysis

Conclusion: 
The results from the paired t-test shows that the p-value less than 0.05 level of significance, there is no significant difference in means between June and December temperatures across all years available.